wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
#include "moviecart_yield.h"
#include "defines.h"
#include "bus_service.h"

#if MOVIECART_INIT_PHASE
#define MC_INIT_STOP(n)							\
	do {								\
		if ((n) == MOVIECART_INIT_PHASE)			\
			emulate_cartridge();				\
	} while (0)
#else
#define MC_INIT_STOP(n)	do { } while (0)
#endif

static void
SDIO_DataConfigGated(SDIO_DataInitTypeDef *cfg)
{
	moviecart_sdio_gate();
	SDIO_DataConfig(cfg);
}

static void
SDIO_SendCommandGated(SDIO_CmdInitTypeDef *cmd)
{
	moviecart_sdio_gate();
	SDIO_SendCommand(cmd);
}

/*
 * IRQs stay masked while the Atari bus is served. DMA completion and SDIO
 * status flags are polled manually; every wait loop yields so RamKernel keeps
 * running on the 6502 side. Initiation and polling both wait for a fresh
 * mc_blanking_window_gen edge before touching SDIO.
 */
static void
SD_PollDmaAndYield(void)
{
	moviecart_bus_yield();
	SD_ProcessIRQSrc();
	moviecart_bus_yield();
	SD_ProcessDMAIRQ();
}

static void
SD_CmdYield(void)
{
	moviecart_bus_yield();
}

static uint32_t CardType = SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;
static uint8_t SDSTATUS_Tab[16];
__IO uint32_t StopCondition = 0;
__IO SD_Error TransferError = SD_OK;
__IO uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;
SD_CardInfo SDCardInfo;

SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
/**
 * @}
 */

/** @defgroup STM324x9I_EVAL_SDIO_SD_Private_Function_Prototypes
 * @{
 */
static SD_Error CmdError (void);
static SD_Error CmdResp1Error (uint8_t cmd);
static SD_Error CmdResp7Error (void);
static SD_Error CmdResp3Error (void);
static SD_Error CmdResp2Error (void);
static SD_Error CmdResp6Error (uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus (FunctionalState NewState);
static SD_Error IsCardProgramming (uint8_t *pstatus);
static SD_Error FindSCR (uint16_t rca, uint32_t *pscr);
uint8_t convert_from_bytes_to_power_of_two (uint16_t NumberOfBytes);

static volatile DSTATUS TM_FATFS_SD_SDIO_Stat = STA_NOINIT;	/* Physical drive status */

#define BLOCK_SIZE            512

/*
 * CMD16 SET_BLOCKLEN(512) is invariant for MovieCart playback. Mount sends it on
 * every read; after SD_PreparePlaybackRead() (or the first successful CMD16)
 * sector reads skip the redundant command.
 */
static uint8_t	sd_blocklen512_done;

static SD_Error
SD_SetBlockLen512(void)
{
	SD_Error errorstatus;

	SDIO_CmdInitStructure.SDIO_Argument = 512;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
	if (errorstatus == SD_OK)
		sd_blocklen512_done = 1;
	return errorstatus;
}

static SD_Error
SD_EnsureBlockLen512(uint16_t BlockSize)
{
	if (sd_blocklen512_done && BlockSize == 512)
		return SD_OK;
	return SD_SetBlockLen512();
}

SD_Error
SD_PreparePlaybackRead(void)
{
	moviecart_sdio_gate();
	return SD_SetBlockLen512();
}

uint8_t TM_FATFS_SDIO_WriteEnabled(void) {
#if FATFS_USE_WRITEPROTECT_PIN > 0
	return !TM_GPIO_GetInputPinValue(FATFS_USE_WRITEPROTECT_PIN_PORT, FATFS_USE_WRITEPROTECT_PIN_PIN);
#else
	return 1;
#endif
}

DSTATUS TM_FATFS_SD_SDIO_disk_initialize(void) {
	/* Pins/clocks are brought up in mc_sd_pins_init() before serving.
	 * Do not RMW GPIOD (cart data) or touch NVIC here. IRQs stay masked;
	 * completion is polled. */

	moviecart_wait_blanking_start();
	sd_blocklen512_done = 0;
	moviecart_bus_yield();
	MC_INIT_STOP(4);

	/* Card power / CMD0 can fail intermittently on DevEBox — retry a few times. */
	{
		int attempt;
		SD_Error err = SD_ERROR;
		for (attempt = 0; attempt < 5; attempt++) {
			if (attempt)
				moviecart_delay_ms(50);
			err = SD_Init();
			if (err == SD_OK)
				break;
		}
		if (err == SD_OK) {
			TM_FATFS_SD_SDIO_Stat &= ~STA_NOINIT;	/* Clear STA_NOINIT flag */
		} else {
			TM_FATFS_SD_SDIO_Stat |= STA_NOINIT;
		}
	}
	//Check write protected
	if (!TM_FATFS_SDIO_WriteEnabled()) {
		TM_FATFS_SD_SDIO_Stat |= STA_PROTECT;
	} else {
		TM_FATFS_SD_SDIO_Stat &= ~STA_PROTECT;
	}
	
	return TM_FATFS_SD_SDIO_Stat;
}

DSTATUS TM_FATFS_SD_SDIO_disk_status(void) {
	if (SD_Detect() != SD_PRESENT) {
		return STA_NOINIT;
	}
	
	if (!TM_FATFS_SDIO_WriteEnabled()) {
		TM_FATFS_SD_SDIO_Stat |= STA_PROTECT;
	} else {
		TM_FATFS_SD_SDIO_Stat &= ~STA_PROTECT;
	}
	
	return TM_FATFS_SD_SDIO_Stat;
}

DRESULT
TM_FATFS_SD_SDIO_disk_read_begin(BYTE *buff, DWORD sector, UINT count)
{
	SD_Error Status = SD_OK;

	if ((TM_FATFS_SD_SDIO_Stat & STA_NOINIT))
		return RES_NOTRDY;
	if (!count || ((DWORD)buff & 3))
		return RES_PARERR;

	moviecart_bus_yield();
	if (count == 1) {
		Status = SD_ReadBlock(buff, sector << 9, BLOCK_SIZE);
	} else {
		Status = SD_ReadMultiBlocks(buff, sector << 9, BLOCK_SIZE, count);
	}

	return Status == SD_OK ? RES_OK : RES_ERROR;
}

DRESULT
TM_FATFS_SD_SDIO_disk_read_finish(void)
{
	SD_Error Status;
	SDTransferState State;

	Status = SD_WaitReadOperation();
	moviecart_bus_yield();

	for (;;) {
		State = SD_GetStatus();
		if (State != SD_TRANSFER_BUSY)
			break;
		moviecart_bus_yield();
	}

	if (State == SD_TRANSFER_ERROR || Status != SD_OK)
		return RES_ERROR;

	return RES_OK;
}

DRESULT TM_FATFS_SD_SDIO_disk_read(BYTE *buff, DWORD sector, UINT count) {
	if ((DWORD)buff & 3) {
		DRESULT res = RES_OK;
		DWORD scratch[BLOCK_SIZE / 4];

		while (count--) {
			res = TM_FATFS_SD_SDIO_disk_read((void *)scratch, sector++, 1);
			if (res != RES_OK)
				break;
			memcpy(buff, scratch, BLOCK_SIZE);
			buff += BLOCK_SIZE;
		}
		return res;
	}

	if (TM_FATFS_SD_SDIO_disk_read_begin(buff, sector, count) != RES_OK)
		return RES_ERROR;
	moviecart_bus_yield();
	return TM_FATFS_SD_SDIO_disk_read_finish();
}

DRESULT TM_FATFS_SD_SDIO_disk_write(const BYTE *buff, DWORD sector, UINT count) {
	SD_Error Status = SD_OK;

	if (!TM_FATFS_SDIO_WriteEnabled()) {
		return RES_WRPRT;
	}

	if (SD_Detect() != SD_PRESENT) {
		return RES_NOTRDY;
	}

	if ((DWORD)buff & 3) {
		DRESULT res = RES_OK;
		DWORD scratch[BLOCK_SIZE / 4];

