wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
		while (count--) {
			memcpy(scratch, buff, BLOCK_SIZE);
			res = TM_FATFS_SD_SDIO_disk_write((void *)scratch, sector++, 1);

			if (res != RES_OK) {
				break;
			}

			buff += BLOCK_SIZE;
		}

		return(res);
	}

	Status = SD_WriteMultiBlocks((uint8_t *)buff, sector << 9, BLOCK_SIZE, count); // 4GB Compliant

	if (Status == SD_OK) {
		SDTransferState State;

		Status = SD_WaitWriteOperation(); // Check if the Transfer is finished
		moviecart_bus_yield();

		for (;;) {
			State = SD_GetStatus();
			if (State != SD_TRANSFER_BUSY)
				break;
			moviecart_bus_yield();
		}

		if ((State == SD_TRANSFER_ERROR) || (Status != SD_OK)) {
			return RES_ERROR;
		} else {
			return RES_OK;
		}
	} else {
		return RES_ERROR;
	}
}

DRESULT TM_FATFS_SD_SDIO_disk_ioctl(BYTE cmd, void *buff) {
	switch (cmd) {
		case GET_SECTOR_SIZE :     // Get R/W sector size (WORD) 
			*(WORD *) buff = 512;
		break;
		case GET_BLOCK_SIZE :      // Get erase block size in unit of sector (DWORD)
			*(DWORD *) buff = 32;
		break;
		case CTRL_SYNC :
		case CTRL_ERASE_SECTOR :
		break;
	}

	return RES_OK;
}

void SDIO_IRQHandler(void) {
	SD_ProcessIRQSrc();
}

#ifdef SD_SDIO_DMA_STREAM3
void DMA2_Stream3_IRQHandler(void) {
	SD_ProcessDMAIRQ();
}
#endif

#ifdef SD_SDIO_DMA_STREAM6
void DMA2_Stream6_IRQHandler(void) {
	SD_ProcessDMAIRQ();
}
#endif



/**
 * @}
 */

/** @defgroup STM324x9I_EVAL_SDIO_SD_Private_Functions
 * @{
 */

/**
 * @brief  DeInitializes the SDIO interface.
 * @param  None
 * @retval None
 */
void SD_DeInit (void) {
	SD_LowLevel_DeInit();
}

/**
 * @brief  Initializes the SD Card and put it into StandBy State (Ready for data
 *         transfer).
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_Init (void)
{
	__IO SD_Error errorstatus = SD_OK;

	moviecart_wait_blanking_start();
	SDIO_DeInit ();
	MC_INIT_STOP(5);
	errorstatus = SD_PowerON ();

	if (errorstatus != SD_OK) {
		logf ("SD_PowerON failed\r\n");
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return (errorstatus);
	}

	logf ("SD_PowerON OK\r\n");
	MC_INIT_STOP(7);

	moviecart_wait_blanking_start();
	errorstatus = SD_InitializeCards ();

	if (errorstatus != SD_OK) {
		logf ("SD_InitializeCards failed\r\n");
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return (errorstatus);
	}

	logf ("SD_InitializeCards OK\r\n");
	MC_INIT_STOP(8);

#if MOVIECART_INIT_PHASE != 94
	/* One register write per fresh $F1C1. A single SDIO_Init while CLKEN is
	 * still set jumps 400 kHz → 8 MHz in one CLKCR store and can AHB-stall
	 * the serve loop for a field. */
	moviecart_wait_blanking_start();
	MC_INIT_STOP(911);

	moviecart_wait_blanking_start();
	SDIO_ClockCmd(DISABLE);
	MC_INIT_STOP(912);

	moviecart_wait_blanking_start();
	SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
	SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
	SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
	SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
	SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
	SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
	SDIO_Init (&SDIO_InitStructure);
	MC_INIT_STOP(913);

	moviecart_wait_blanking_start();
	SDIO_ClockCmd(ENABLE);
	MC_INIT_STOP(91);
#endif

	moviecart_wait_blanking_start();
	/*----------------- Read CSD/CID MSD registers ------------------*/
	errorstatus = SD_GetCardInfo (&SDCardInfo);

	if (errorstatus == SD_OK) {
		logf ("SD_GetCardInfo OK\r\n");
		MC_INIT_STOP(92);
		/*----------------- Select Card --------------------------------*/
		moviecart_wait_blanking_start();
		errorstatus = SD_SelectDeselect ((uint32_t) (SDCardInfo.RCA << 16));
	}
	else {
		logf ("SD_SelectDeselect failed\r\n");
	}

	if (errorstatus == SD_OK) {
		logf ("SD_SelectDeselect OK\r\n");
		MC_INIT_STOP(94);
		MC_INIT_STOP(9);
		moviecart_wait_blanking_start();
		#if FATFS_SDIO_4BIT == 1
		/* Prefer 4-bit; fall back to 1-bit if wide-bus fails (noisy DAT1-3). */
		errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_4b);
		if (errorstatus != SD_OK) {
			moviecart_bus_yield();
			errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_1b);
		}
#else
		errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_1b);
#endif
	}
	else {
		logf ("SD_EnableWideBusOperation failed\r\n");
	}

	if (errorstatus == SD_OK) {
		logf ("SD_EnableWideBusOperation OK\r\n");
		MC_INIT_STOP(10);
	}

	return (errorstatus);
}

/**
 * @brief  Gets the cuurent sd card data transfer status.
 * @param  None
 * @retval SDTransferState: Data Transfer state.
 *   This value can be:
 *        - SD_TRANSFER_OK: No data transfer is acting
 *        - SD_TRANSFER_BUSY: Data transfer is acting
 */
SDTransferState SD_GetStatus (void)
{
	SDCardState cardstate = SD_CARD_TRANSFER;

	cardstate = SD_GetState ();

	if (cardstate == SD_CARD_TRANSFER) {
		return (SD_TRANSFER_OK);
	} else if (cardstate == SD_CARD_ERROR) {
		return (SD_TRANSFER_ERROR);
	} else {
		return (SD_TRANSFER_BUSY);
	}
}

/**
 * @brief  Returns the current card's state.
 * @param  None
 * @retval SDCardState: SD Card Error or SD Card Current State.
 */
SDCardState SD_GetState(void) {
	uint32_t resp1 = 0;

	if (SD_Detect () == SD_PRESENT ) {
		if (SD_SendStatus (&resp1) != SD_OK) {
			return SD_CARD_ERROR;
		} else {
			return (SDCardState) ((resp1 >> 9) & 0x0F);
		}
	}
	
	return SD_CARD_ERROR;
}

/**
 * @brief  Detect if SD card is correctly plugged in the memory slot.
 * @param  None
 * @retval Return if SD is detected or not
 */
uint8_t SD_Detect(void) {
	__IO uint8_t status = SD_PRESENT;

	/* Check status */
	if (!TM_FATFS_CheckCardDetectPin()) {
		status = SD_NOT_PRESENT;
	}

	/* Return status */
	return status;
}

/**
 * @brief  Enquires cards about their operating voltage and configures
 *   clock controls.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_PowerON (void)
{
	__IO SD_Error errorstatus = SD_OK;
	uint32_t response = 0, count = 0, validvoltage = 0;
	uint32_t SDType = SD_STD_CAPACITY;

	/*!< Power ON Sequence -----------------------------------------------------*/
	/*!< Configure the SDIO peripheral */
	/*!< SDIO_CK = SDIOCLK / (SDIO_INIT_CLK_DIV + 2) */
	/*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
	/*!< SDIO_CK for initialization should not exceed 400 KHz */
	SDIO_InitStructure.SDIO_ClockDiv = SDIO_INIT_CLK_DIV;
	SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
	SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
	SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
	SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
	SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
	SDIO_Init (&SDIO_InitStructure);
	moviecart_bus_yield();

	/*!< Set Power State to ON */
	SDIO_SetPowerState (SDIO_PowerState_ON);
	moviecart_bus_yield();

	/*!< Enable SDIO Clock */
	SDIO_ClockCmd (ENABLE);

