wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
	if (errorstatus != SD_OK) {
		return (errorstatus);
	}

	/*!< CMD55 */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);
	errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

	if (errorstatus != SD_OK) {
		return (errorstatus);
	}

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 64;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfigGated(&SDIO_DataInitStructure);

	/*!< Send ACMD13 SD_APP_STAUS  with argument as card's RCA.*/
	SDIO_CmdInitStructure.SDIO_Argument = 0;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_STAUS;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);
	errorstatus = CmdResp1Error (SD_CMD_SD_APP_STAUS );

	if (errorstatus != SD_OK) {
	return (errorstatus);
	}

	while (!(SDIO ->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
		if (SDIO_GetFlagStatus (SDIO_FLAG_RXFIFOHF) != RESET) {
			for (count = 0; count < 8; count++) {
				*(psdstatus + count) = SDIO_ReadData ();
			}
			psdstatus += 8;
		}
	}

	if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_DTIMEOUT);
		errorstatus = SD_DATA_TIMEOUT;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_DCRCFAIL);
		errorstatus = SD_DATA_CRC_FAIL;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_RXOVERR);
		errorstatus = SD_RX_OVERRUN;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_STBITERR);
		errorstatus = SD_START_BIT_ERR;
		return (errorstatus);
	}

	count = SD_DATATIMEOUT;
	while ((SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) && (count > 0)) {
		*psdstatus = SDIO_ReadData ();
		psdstatus++;
		count--;
	}
	/*!< Clear all the static status flags*/
	SDIO->ICR =  (SDIO_STATIC_FLAGS );

	return (errorstatus);
}

/**
 * @brief  Allows to process all the interrupts that are high.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_ProcessIRQSrc (void)
{
	if (SDIO_GetITStatus (SDIO_IT_DATAEND) != RESET) {
		TransferError = SD_OK;
		SDIO_ClearITPendingBit (SDIO_IT_DATAEND);
		TransferEnd = 1;
		logf ("SDIO IRQ : TransferEnd = 1, OK\r\n");
	} else if (SDIO_GetITStatus (SDIO_IT_DCRCFAIL) != RESET) {
		SDIO_ClearITPendingBit (SDIO_IT_DCRCFAIL);
		TransferError = SD_DATA_CRC_FAIL;
		logf ("SDIO IRQ : SD_DATA_CRC_FAIL\r\n");
	} else if (SDIO_GetITStatus (SDIO_IT_DTIMEOUT) != RESET) {
		SDIO_ClearITPendingBit (SDIO_IT_DTIMEOUT);
		TransferError = SD_DATA_TIMEOUT;
		logf ("SDIO IRQ : SD_DATA_TIMEOUT\r\n");
	} else if (SDIO_GetITStatus (SDIO_IT_RXOVERR) != RESET) {
		SDIO_ClearITPendingBit (SDIO_IT_RXOVERR);
		TransferError = SD_RX_OVERRUN;
		logf ("SDIO IRQ : SD_RX_OVERRUN\r\n");
	} else if (SDIO_GetITStatus (SDIO_IT_TXUNDERR) != RESET) {
		SDIO_ClearITPendingBit (SDIO_IT_TXUNDERR);
		TransferError = SD_TX_UNDERRUN;
		logf ("SDIO IRQ : SD_TX_UNDERRUN\r\n");
	} else if (SDIO_GetITStatus (SDIO_IT_STBITERR) != RESET) {
		SDIO_ClearITPendingBit (SDIO_IT_STBITERR);
		TransferError = SD_START_BIT_ERR;
		logf ("SDIO IRQ : SD_START_BIT_ERR\r\n");
	}

	SDIO->MASK &= ~(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR | SDIO_IT_RXOVERR | SDIO_IT_STBITERR);
	return (TransferError);
}

/**
 * @brief  This function waits until the SDIO DMA data transfer is finished.
 * @param  None.
 * @retval None.
 */
void SD_ProcessDMAIRQ(void) {
#ifdef SD_SDIO_DMA_STREAM3
	if (DMA2->LISR & SD_SDIO_DMA_FLAG_TCIF) {
#else
	if (DMA2->HISR & SD_SDIO_DMA_FLAG_TCIF) {
#endif
		DMAEndOfTransfer = 0x01;
		DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_TCIF | SD_SDIO_DMA_FLAG_FEIF);
	}
}

/**
 * @brief  Checks for error conditions for CMD0.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdError (void)
{
	SD_Error errorstatus = SD_OK;
	uint32_t timeout;

	timeout = SDIO_CMD0TIMEOUT; /*!< 10000 */

	while (timeout > 0) {
		moviecart_bus_yield();
		if (SDIO_GetFlagStatus (SDIO_FLAG_CMDSENT) != RESET)
			break;
		timeout--;
	}

	if (timeout == 0) {
		errorstatus = SD_CMD_RSP_TIMEOUT;
		return (errorstatus);
	}

	/*!< Clear all the static flags */
	SDIO->ICR =  (SDIO_STATIC_FLAGS );

	return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R7 response.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp7Error (void)
{
	SD_Error errorstatus = SD_OK;
	uint32_t status;
	uint32_t timeout = SDIO_CMD0TIMEOUT;

	while (timeout > 0) {
		moviecart_bus_yield();
		status = SDIO ->STA;
		if (status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT))
			break;
		timeout--;
	}

	if ((timeout == 0) || (status & SDIO_FLAG_CTIMEOUT)) {
		/*!< Card is not V2.0 complient or card does not support the set voltage range */
		errorstatus = SD_CMD_RSP_TIMEOUT;
		SDIO->ICR =  (SDIO_FLAG_CTIMEOUT);
		return (errorstatus);
	}

	if (status & SDIO_FLAG_CMDREND) {
		/*!< Card is SD V2.0 compliant */
		errorstatus = SD_OK;
		SDIO->ICR =  (SDIO_FLAG_CMDREND);
		return (errorstatus);
	}
	return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R1 response.
 * @param  cmd: The sent command index.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp1Error (uint8_t cmd)
{
	SD_Error errorstatus = SD_OK;
	uint32_t status;
	uint32_t response_r1;
	uint32_t timeout;

