wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
	if (respR1 & SD_OCR_CARD_ECC_DISABLED ) {
		return (SD_CARD_ECC_DISABLED);
	}

	if (respR1 & SD_OCR_ERASE_RESET ) {
		return (SD_ERASE_RESET);
	}

	if (respR1 & SD_OCR_AKE_SEQ_ERROR ) {
		return (SD_AKE_SEQ_ERROR);
	}

	return (errorstatus);
}

/**
 * @brief  Find the SD card SCR register value.
 * @param  rca: selected card address.
 * @param  pscr: pointer to the buffer that will contain the SCR value.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error FindSCR (uint16_t rca, uint32_t *pscr)
{
	uint32_t index = 0;
	SD_Error errorstatus = SD_OK;
	uint32_t tempscr[2] = { 0, 0 };

	/*!< Set Block Size To 8 Bytes */
	/*!< Send CMD55 APP_CMD with argument as card's RCA */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) 8;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

	if (errorstatus != SD_OK) {
		return (errorstatus);
	}

	/*!< Send CMD55 APP_CMD with argument as card's RCA */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

	if (errorstatus != SD_OK) {
		return (errorstatus);
	}
	
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 8;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_8b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfigGated(&SDIO_DataInitStructure);

	/*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
	SDIO_CmdInitStructure.SDIO_Argument = 0x0;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommandGated(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error (SD_CMD_SD_APP_SEND_SCR );

	if (errorstatus != SD_OK) {
		return (errorstatus);
	}

	while (!(SDIO ->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
		moviecart_bus_yield();
		if (SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) {
			*(tempscr + index) = SDIO_ReadData ();
			index++;
		}
	}

	if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_DTIMEOUT);
		errorstatus = SD_DATA_TIMEOUT;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_DCRCFAIL);
		errorstatus = SD_DATA_CRC_FAIL;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_RXOVERR);
		errorstatus = SD_RX_OVERRUN;
		return (errorstatus);
	} else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
		SDIO->ICR =  (SDIO_FLAG_STBITERR);
		errorstatus = SD_START_BIT_ERR;
		return (errorstatus);
	}

	/*!< Clear all the static flags */
	SDIO->ICR =  (SDIO_STATIC_FLAGS );

	*(pscr + 1) = ((tempscr[0] & SD_0TO7BITS )<< 24)|((tempscr[0] & SD_8TO15BITS )<< 8)|((tempscr[0] & SD_16TO23BITS )>> 8)|((tempscr[0] & SD_24TO31BITS )>> 24);

	*(pscr) = ((tempscr[1] & SD_0TO7BITS )<< 24)|((tempscr[1] & SD_8TO15BITS )<< 8)|((tempscr[1] & SD_16TO23BITS )>> 8)|((tempscr[1] & SD_24TO31BITS )>> 24);

	return (errorstatus);
}

/**
 * @brief  Converts the number of bytes in power of two and returns the power.
 * @param  NumberOfBytes: number of bytes.
 * @retval None
 */
uint8_t convert_from_bytes_to_power_of_two (uint16_t NumberOfBytes)
{
	uint8_t count = 0;

	while (NumberOfBytes != 1) {
		NumberOfBytes >>= 1;
		count++;
	}
	return (count);
}

/**
 * @brief  Switch mode High-Speed
 * @note   This function must be used after "Transfer State"
 * @note   This operation should be followed by the configuration
 *         of PLL to have SDIOCK clock between 67 and 75 MHz
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_HighSpeed (void)
{
	SD_Error errorstatus = SD_OK;
	uint32_t scr[2] = { 0, 0 };
	uint32_t SD_SPEC = 0;
	uint8_t hs[64] = { 0 };
	uint32_t count = 0, *tempbuff = (uint32_t *) hs;
	TransferError = SD_OK;
	TransferEnd = 0;
	StopCondition = 0;

	SDIO->DCTRL = 0x0;

	/*!< Get SCR Register */
	errorstatus = FindSCR (RCA, scr);
	moviecart_bus_yield();

	if (errorstatus != SD_OK) {
		return (errorstatus);
	}

	/* Test the Version supported by the card*/
	SD_SPEC = (scr[1] & 0x01000000) || (scr[1] & 0x02000000);

	if (SD_SPEC != SD_ALLZERO ) {
		/* Set Block Size for Card */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) 64;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommandGated(&SDIO_CmdInitStructure);
		
		errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN);
		
		if (errorstatus != SD_OK) {
			return (errorstatus);
		}
		
		SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
		SDIO_DataInitStructure.SDIO_DataLength = 64;
		SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
		SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
		SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
		SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
		SDIO_DataConfigGated(&SDIO_DataInitStructure);

		/*!< Send CMD6 switch mode */
		SDIO_CmdInitStructure.SDIO_Argument = 0x80FFFF01;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_HS_SWITCH;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommandGated(&SDIO_CmdInitStructure);
		errorstatus = CmdResp1Error (SD_CMD_HS_SWITCH );

